---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StructuralConnectionFailures.StructuralConnectionNotEnoughRefs
source: html/6141d3ad-2808-1b85-d055-e2958a56064c.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StructuralConnectionFailures.StructuralConnectionNotEnoughRefs Property

Structural Connection Handler cannot connect fewer than two elements.

## Syntax (C#)
```csharp
public static FailureDefinitionId StructuralConnectionNotEnoughRefs { get; }
```